snlkuharlocal/src/Documents/ВиртуальныйРезерв/ВиртуальныйРезерв.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВиртуальныйРезерв</name>
  <comment>Резервирует товар по виртуальным складам</comment>
  <basedOn>Document.ВиртуальныйРезерв</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ВиртуальныйРезерв/ObjectModule.bsl
Перем НачСостНакладной;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)			
	ЕстьИзменения		=Модифицированность();
		
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		Если Отказ Тогда Возврат КонецЕсли; 
	КонецЕсли;	
		
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;		
			
	ОбъемДокумента		= Товары.Итог("Объем");
	КоличествоДокумента = Товары.Итог("Количество");
	ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	Для Каждого ТекСтрокаТовары Из Товары Цикл		
		Движение = Движения.РезервыТМЦ.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Заказ			= Ссылка;
		Движение.Склад			= Склад.ФизическийСклад;
		Движение.Получатель		= Склад;
		Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
		Движение.Количество		= ТекСтрокаТовары.Количество;
	КонецЦикла;	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
	ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	Если ВариантЗаполнения=Неопределено Тогда
		ВариантЗаполнения="Целиком";
	КонецЕсли;	
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;
	
	Если ВидОснования="Перемещение" Тогда
		Склад		= ДокОснование.СкладПолучатель;	
	Иначе		
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	КонецЕсли;	
	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
				
	Если ВариантЗаполнения="РазницаСНабором" Тогда
		Форма=Обработки.СравнениеЛистовНабора.ПолучитьФорму();		
		Форма.Документ		=ДокОснование;
	
		РезультатСравнения	=Форма.ПолучитьОшибкиНабора();	
		ТН					=РезультатСравнения.ТН;
		
		Дата				=ДокОснование.Дата;
		ДатаОтгрузки		=Дата;
		
		Комментарий		= "Недостача по ";
	Иначе
		Комментарий		= "";
	КонецЕсли;	
	
	Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
		Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="Целиком" Тогда			
			Если СтрокаТЧ.Заявка=0 Тогда
				СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
			КонецЕсли;
			Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
				СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
			КонецЕсли;
		ИначеЕсли ВариантЗаполнения="РазницаСНабором" Тогда
			СтрокаТН=ТН.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаТН=Неопределено Тогда
				СтрокаТЧ.Количество=0;	
			Иначе
				СтрокаТЧ.Количество				=СтрокаТН.Разница;
				СтрокаТЧ.Заявка					=СтрокаТН.Разница;
				СтрокаТЧ.ПодтвержденнаяЗаявка	=СтрокаТН.Разница;
			КонецЕсли;			
		КонецЕсли;		
						
		Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	Автор				=Неопределено;
КонецПроцедуры

ЗаписьБезКонтроля=Ложь;
